app/controllers/v1/login_controller.rb

INSERT INTO "logins" ("email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "tdowgwhite@googlemail.com"], ["password", "1234"], ["created_at", "2020-06-11 10:31:13.397730"], ["updated_at", "2020-06-11 10:31:13.397730"]]
---
    def create

        @login = Login.new(login_params)
        @login.save