app/controllers/gigs_controller.rb

SELECT "gigs".* FROM "gigs" WHERE "gigs"."userId" = ?  [["userId", 1]]
---
    def index
        @gigs = Gig.where(userId: session[:user_id])

SELECT "gigs".* FROM "gigs" WHERE "gigs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def show
        @gig = Gig.find(params[:id])

INSERT INTO "gigs" ("userId", "gigId", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["userId", 2], ["gigId", 39275915], ["created_at", "2020-07-22 13:11:28.600483"], ["updated_at", "2020-07-22 13:11:28.600483"]]
---
    def create
        @gig = Gig.new(gig_params)
        if @gig.save